Repository: camoa/laollita
Catalog: modules/custom/recetas_shopping_list/translations/recetas_shopping_list.*.po
Languages: es, fr, it

source: Create Shopping List
es: Crear Lista de Compras
fr: Créer une Liste de Courses
it: Crea Lista della Spesa

source: Create a shopping list from multiple recipes
es: Crear una lista de compras desde múltiples recetas
fr: Créer une liste de courses à partir de plusieurs recettes
it: Crea una lista della spesa da pi√π ricette

source: Generate Shopping List
es: Generar Lista de Compras
fr: Générer la Liste de Courses
it: Genera Lista della Spesa

source: Update Shopping List
es: Actualizar Lista de Compras
fr: Mettre à Jour la Liste de Courses
it: Aggiorna Lista della Spesa

source: Shopping list generated successfully!
es: ¡Lista de compras generada exitosamente!
fr: Liste de courses générée avec succès!
it: Lista della spesa generata con successo!

source: Please add at least one recipe before generating the shopping list.
es: Por favor agregue al menos una receta antes de generar la lista de compras.
fr: Veuillez ajouter au moins une recette avant de générer la liste de courses.
it: Aggiungi almeno una ricetta prima di generare la lista della spesa.

source: No valid recipes found.
es: No se encontraron recetas válidas.
fr: Aucune recette valide trouvée.
it: Nessuna ricetta valida trovata.

source: No ingredients found in the selected recipes.
es: No se encontraron ingredientes en las recetas seleccionadas.
fr: Aucun ingrédient trouvé dans les recettes sélectionnées.
it: Nessun ingrediente trovato nelle ricette selezionate.

source: Failed to generate shopping list: @message
es: Error al generar la lista de compras: @message
fr: Échec de la génération de la liste de courses: @message
it: Impossibile generare la lista della spesa: @message

source: Select the recipes you want to include in your shopping list
es: Seleccione las recetas que desea incluir en su lista de compras
fr: Sélectionnez les recettes que vous souhaitez inclure dans votre liste de courses
it: Seleziona le ricette che desideri includere nella tua lista della spesa

source: The generated shopping list (managed by AI agent)
es: La lista de compras generada (administrada por agente de IA)
fr: La liste de courses générée (gérée par l'agent IA)
it: La lista della spesa generata (gestita da agente AI)

source: Recipes
es: Recetas
fr: Recettes
it: Ricette

source: Shopping List
es: Lista de Compras
fr: Liste de Courses
it: Lista della Spesa

source: Number of Servings
es: Número de Porciones
fr: Nombre de Portions
it: Numero di Porzioni

source: How many servings should this shopping list make? Ingredients will be scaled accordingly.
es: ¿Para cuántas porciones debe ser esta lista de compras? Los ingredientes se ajustarán en consecuencia.
fr: Pour combien de portions cette liste de courses doit-elle être préparée? Les ingrédients seront ajustés en conséquence.
it: Per quante porzioni deve essere questa lista della spesa? Gli ingredienti verranno adeguati di conseguenza.
